jacky4566/Veridian-Heliograph/Firmware/STM32L031G6U6_Demo/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"
#include "stm32l0xx_ll_lpuart.h"
#include "stm32l0xx_ll_rcc.h"
#include "stm32l0xx_ll_bus.h"
#include "stm32l0xx_ll_cortex.h"
#include "stm32l0xx_ll_system.h"
#include "stm32l0xx_ll_utils.h"
#include "stm32l0xx_ll_pwr.h"
#include "stm32l0xx_ll_gpio.h"
#include "stm32l0xx_ll_dma.h"

#include "stm32l0xx_ll_exti.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ADC_SOLAR_Pin GPIO_PIN_0
#define ADC_SOLAR_GPIO_Port GPIOA
#define GPS_EXT_Pin GPIO_PIN_1
#define GPS_EXT_GPIO_Port GPIOA
#define LIS_CS_Pin GPIO_PIN_4
#define LIS_CS_GPIO_Port GPIOA
#define LIS_INT_Pin GPIO_PIN_0
#define LIS_INT_GPIO_Port GPIOB
#define LIS_INT_EXTI_IRQn EXTI0_1_IRQn
#define VBAT_OK_Pin GPIO_PIN_1
#define VBAT_OK_GPIO_Port GPIOB
#define VBAT_OK_EXTI_IRQn EXTI0_1_IRQn
#define DISPEN_Pin GPIO_PIN_8
#define DISPEN_GPIO_Port GPIOA
#define DISPCS_Pin GPIO_PIN_10
#define DISPCS_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
